simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
static uint8 cal_pi_run_service(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 sample;
    int32 control_sample;
    int32 error_counts;
    int32 error_dac;
    int32 control_error;
    int32 effort;
    int32 p_term;
    int32 i_term;
    int32 stage_gain_x1000;
    int32 deadband_dac;
    int32 error_bucket;
    int32 dac_max_step_up;
    int32 dac_max_step_down;
    uint16 sample_index;
    uint16 lock_n;
    int16 dac_sample;
    int16 dac_lo;
    int16 dac_hi;
    int16 dac_target;
    int16 dac_step;
    uint8 can_integrate;
    uint8 dac_changed;
    int8 effort_delta_sign;

    if (!psoc_adc_take_isr_filtered_sample(&sample)) {
        g_cal_pi.empty_polls++;
        if (g_cal_pi.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            return cal_pi_finish_stage(0u);
        }
        return 0u;
    }
    g_cal_pi.empty_polls = 0UL;

    /* Sin promediado/EMA en software: el FIR de hardware (Canal A del
     * Filter, FIR_calibration.h) ya extrajo el DC -- fir_output es
     * directamente la muestra filtrada. */
    g_cal_pi.last_fir_output = sample;
    control_sample = cal_pi_compare_counts(g_cal_pi.last_fir_output);
    error_counts = stage->target_counts - control_sample;
    error_dac = cal_counts_error_to_dac_scale(error_counts);
    stage_gain_x1000 = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
    deadband_dac = cal_pi_deadband_dac_codes(g_cal_async.stage_index);
    control_error = (abs_counts(error_dac) <= deadband_dac) ? 0L : error_dac;
    error_bucket = cal_pi_error_bucket(error_dac, deadband_dac);
    dac_sample = g_cal_pi.dac_current;

    dac_lo = cal_stage_min_dac(stage);
    dac_hi = cal_stage_max_dac(stage);
    can_integrate = 0u;

    if (stage_gain_x1000 == 0L) {
        /* Una etapa configurada con ganancia dinamica puede carecer de
         * autoridad en algun ajuste; no se persigue el error hasta saturar. */
        effort = (int32)dac_sample;
    } else if (control_error == 0L) {
        g_cal_pi.integral = 0L;
        effort = (int32)dac_sample;
    } else {
        /* PI posicional en escala DAC: error_counts -> error_dac antes de
         * entrar al PI; P/I se dividen por la ganancia fisica VDAC->medida. */
        p_term = cal_pi_gain_scaled_term(control_error, cfg->kp_num, cfg->kp_div, stage_gain_x1000);
        i_term = cal_pi_gain_scaled_term(g_cal_pi.integral, cfg->ki_num, cfg->ki_div, stage_gain_x1000);
        effort = (int32)g_cal_pi.base_dac + (int32)stage->direction * (p_term + i_term);
    }

    effort_delta_sign = cal_pi_effort_delta_sign(control_error, stage->direction, stage_gain_x1000);

    if (effort < (int32)dac_lo) {
        dac_target = dac_lo;
        can_integrate = (effort_delta_sign > 0) ? 1u : 0u;
    } else if (effort > (int32)dac_hi) {
        dac_target = dac_hi;
        can_integrate = (effort_delta_sign < 0) ? 1u : 0u;
    } else {
        dac_target = (int16)effort;
        can_integrate = 1u;
    }

    /* Limitador de pendiente: con la macro en 0 no se limita nada y manda la
     * ley del PI, que es lo correcto. Estaba fijo en 1 codigo por muestra y eso
     * no protegia de nada: solo impedia que el PI aplicara su propio esfuerzo,
     * y una etapa que necesitaba 84 codigos tardaba 84 muestras como piso. */
    dac_step = (int16)CAL_PI_MAX_DAC_STEP_PER_SAMPLE;
    if (dac_step > 0) {
        dac_max_step_up = (int32)dac_sample + (int32)dac_step;
        dac_max_step_down = (int32)dac_sample - (int32)dac_step;
        if ((int32)dac_target > dac_max_step_up) {
            dac_target = (int16)dac_max_step_up;
        } else if ((int32)dac_target < dac_max_step_down) {
            dac_target = (int16)dac_max_step_down;
        }
        dac_target = cal_stage_clamp_dac(stage, dac_target);
    }
    dac_changed = (dac_target != dac_sample) ? 1u : 0u;

    /* anti-windup tipo clamping y zona muerta: dentro de deadband no se
     * acumula error para no perseguir pasos imposibles del VDAC. */
    if (can_integrate && stage_gain_x1000 != 0L && control_error != 0L) {
        g_cal_pi.integral = cal_pi_clip_integral(g_cal_pi.integral + control_error);
    }

    /* Lock por M muestras: dentro de deadband cierra OK. Fuera de deadband,
     * mantener el mismo bucket no alcanza para cerrar mientras la integral
     * todavia puede acumular el siguiente LSB de DAC. Un cambio efectivo de
     * DAC reinicia el contador de estabilidad. */
    lock_n = (cfg->lock_samples == 0u || cfg->lock_samples > CAL_PI_LOCK_N_MAX)
        ? CAL_PI_LOCK_N_MAX : cfg->lock_samples;

    if (!g_cal_pi.have_last_error ||
        error_bucket != g_cal_pi.last_error_bucket ||
        dac_changed) {
        g_cal_pi.stable_count = 1u;
    } else if (g_cal_pi.stable_count < 65535u) {
        g_cal_pi.stable_count++;
    }
    g_cal_pi.have_last_error = 1u;
    g_cal_pi.last_error_dac = error_dac;
    g_cal_pi.last_error_bucket = error_bucket;
    g_cal_pi.last_dac_target = dac_target;

    sample_index = (uint16)(g_cal_pi.samples_taken + 1u);
    g_cal_pi.samples_taken = sample_index;
    if (sample_index == 1u || (sample_index % CAL_PI_TELEM_PERIOD) == 0u) {
        cal_diag_i16(PSOC_EVT_CAL_STAGE_DAC, (int32)dac_sample);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, g_cal_pi.last_fir_output);
        cal_diag_i32(PSOC_EVT_CAL_PI_ERROR32, error_dac);
        cal_diag_i32(PSOC_EVT_CAL_PI_BUCKET32, error_bucket);
        cal_diag(PSOC_EVT_CAL_PI_STABLE,
                 (g_cal_pi.stable_count > 255u) ? 255u : (uint8)g_cal_pi.stable_count);
    }

    g_cal_pi.dac_current = dac_target;
    stage->write(g_cal_pi.dac_current);

    if (g_cal_pi.stable_count >= lock_n) {
        if (error_bucket == 0L && cal_pi_measurement_valid(g_cal_pi.last_fir_output)) {
            return cal_pi_finish_stage(1u);
        }
        if (stage_gain_x1000 == 0L) {
            return cal_pi_finish_stage(0u);
        }
    }

    if (g_cal_pi.samples_taken >= cfg->timeout_samples) {
        return cal_pi_finish_stage((error_bucket == 0L &&
                                    cal_pi_measurement_valid(g_cal_pi.last_fir_output)) ? 1u : 0u);
    }

    return 0u;
}

